app/Controllers/Admin.php

SELECT *
FROM `daftar`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `daftar`
---
    public function index()
    {
        $tombolcari = $this->request->getPost('tombolcari');

        if (isset($tombolcari)) {
            $cari = $this->request->getPost('cari');
            redirect()->to('/Admin/index');
        } else {
            $cari = session()->get('cari_judul');
        }

        $dataKategori = $cari ? $this->bimbelmodel->cariData($cari)->paginate(5, 'daftar') : $this->bimbelmodel->paginate(5, 'daftar');